#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_backend_bucket.default will be created
  + resource "google_compute_backend_bucket" "default" {
      + bucket_name        = "davidbour-cloud-resume-db"
      + creation_timestamp = (known after apply)
      + description        = "cloud resume backend"
      + enable_cdn         = true
      + id                 = (known after apply)
      + name               = "cloud-resume-db-backend-bucket"
      + project            = (known after apply)
      + self_link          = (known after apply)

      + cdn_policy {
          + cache_mode        = "CACHE_ALL_STATIC"
          + client_ttl        = 3600
          + default_ttl       = 3600
          + max_ttl           = 3600
          + negative_caching  = true
          + serve_while_stale = 3600
        }
    }

  # google_compute_global_address.default will be created
  + resource "google_compute_global_address" "default" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "resume"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_global_forwarding_rule.default will be created
  + resource "google_compute_global_forwarding_rule" "default" {
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = "TCP"
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "https-lb-forwarding-rule"
      + network               = (known after apply)
      + port_range            = "443"
      + project               = (known after apply)
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_managed_ssl_certificate.default will be created
  + resource "google_compute_managed_ssl_certificate" "default" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "cloud-resume-cert-managed"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "davidbour.com",
              + "api.davidbour.com",
              + "www.davidbour.com",
            ]
        }
    }

  # google_compute_target_https_proxy.default will be created
  + resource "google_compute_target_https_proxy" "default" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cloud-https-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.default will be created
  + resource "google_compute_url_map" "default" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "http-lb"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_firebase_database_instance.default will be created
  + resource "google_firebase_database_instance" "default" {
      + database_url  = (known after apply)
      + desired_state = "ACTIVE"
      + id            = (known after apply)
      + instance_id   = "cloudops-388321-default-rtdb"
      + name          = (known after apply)
      + project       = (known after apply)
      + region        = "us-central1"
      + state         = (known after apply)
      + type          = "DEFAULT_DATABASE"
    }

  # google_firebase_project.default will be created
  + resource "google_firebase_project" "default" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = (known after apply)
      + project_number = (known after apply)
    }

  # google_project_iam_member.cloudrun-invoker will be created
  + resource "google_project_iam_member" "cloudrun-invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cloudops-388321"
      + role    = "roles/run.invoker"
    }

  # google_project_service.firebase_database will be created
  + resource "google_project_service" "firebase_database" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "firebasedatabase.googleapis.com"
    }

  # google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "cloud-run-invoker"
      + description  = "Used to run Cloud Run"
      + disabled     = false
      + display_name = "Cloud Run Invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.default will be created
  + resource "google_storage_bucket" "default" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-EAST1"
      + name                        = "davidbour-cloud-resume-db"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "404.html"
        }
    }

  # google_storage_bucket_iam_member.default will be created
  + resource "google_storage_bucket_iam_member" "default" {
      + bucket = "davidbour-cloud-resume-db"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*